{
    "experiences": [
        {
            "jobTitle": "Software Engineer Intern",
            "company": "Knoxville Utilities Board",
            "location": "Knoxville, TN",
            "date": "May 2023 - Present",
            "descriptions": [
                "Harness tools/software such as Jira, EmberJS, Java EE, Git, Postman, SoapUI, and Oracle SQL Developer under the scope of the Agile-Scrum methodology.",
                "Contribute to full-stack development by building custom applications and integrations company wide.",
                "Understand all layers of development from the front-end UI to the low-level enterprise systems/databases."
            ]
        },
        {
            "jobTitle": "Data Science Teaching Assistant",
            "company": "University of Tennessee, Knoxville - Department of Anthropology",
            "location": "Knoxville, TN",
            "date": "January - May 2022",
            "descriptions": [
                "Assisted students in understanding data science fundamentals using statistical packages in Python.",
                "Answered and resolved technical problems asked by students in lab sessions or by email.",
                "Graded and corrected students' weekly coding assignments."
            ]
        },
        {
            "jobTitle": "Condensed Matter Physics Research Assistant",
            "company": "University of Tennessee, Knoxville - Department of Physics",
            "location": "Knoxville, TN",
            "date": "February - October 2020",
            "descriptions": [
                "Worked alongside PI and graduate students in research relating to the field of condensed matter physics.",
                "Calculated, measured and synthesized compounds needed for experiments within the research group."
            ]
        }
    ],
    "projects": [
        {
            "title": "Web-Based Chess Engine",
            "techStack": "C++, WebAssembly, JavaScript, TailwindCSS, Svelte",
            "description": "This web-based chess engine is an application that enables users to play chess against AI from the browser. It is primarily built using C++, WebAssembly, JavaScript, TailwindCSS, and Svelte. The engine's core functionality, including game logic and advanced AI algorithms, is implemented in C++ and compiled into WebAssembly for use across the web. The UI, designed with JavaScript, TailwindCSS, and Svelte, provides an intuitive and responsive platform.",
            "link": "https://github.com/utk-cs340-fall22/Chess",
            "image": "./images/ChessWebApplication.png"
        },
        {
            "title": "Personal Website React Application",
            "techStack": "React, TailwindCSS",
            "description": "This was my first time ever using React or Tailwind. I mostly aimed to learn the basics of React, thus I took advantage of Tailwind's easy-to-use styling to put my major focus on the mechanics of React. From this, I was able to learn a great deal about React, and still have a fairly flashy UI without having to spend hours using regular CSS. I also used some React-specific libraries to add a little more flair to my project. Overall, I learned to take advantage of the React library to create a web application.",
            "link": "https://github.com/Jxk0be/Jake-Shoffner",
            "image": "./images/personalWebsiteReact.png"
        },
        {
            "title": "YouTube Metadata Machine Learning Research Project",
            "techStack": "Python, Pandas, scikit-learn, Jupyter Notebook",
            "description": "We addressed the challenge faced by online creators who rely solely on their YouTube income, which heavily depends on the popularity of their vidoes to generate a satisfactory income. To increase their chances of success, creators must regularly analyze trends and data to identify the most profitable content to create. Our work focused on utilizing predictive modeling techniques such as regression and classification to identify key variables such as video category IDs, view counts, and channel subscribers, and identified the most influential factors on our models.",
            "link": "https://github.com/Jxk0be/YouTube-Metadata-ML-Research-Project",
            "image": "./images/youtubeMLProject.png"
        },
        {
            "title": "Phishing Website: Spear Phishing Project",
            "techStack": "DevTools, PHP, HTML",
            "description": "In this project, I took the role of an attacker to gain a deeper understanding of their thought processes. The goal was to exploit GitHub by executing a spear phishing attack. To accomplish this, I created a convincing phishing website that closely resembled GitHub's official site. Crucially, I ensured that victims, upon visiting the phishing site, were seamlessly redirected to the legitimate site, leaving no trace or suspicion. This project provided valuable insights into the tactics and techniques employed by attackers in compromising user login information.",
            "link": "https://github.com/Jxk0be/stealingYourAnime",
            "image": "./images/githubPhishingWebsite.png"
        }
    ],
    "WIPs": [
        {
           "title": "Discord Bot: A Small Community Server Bot",
           "techStack": "JavaScript, discord.js",
           "description": "Currently working on core functionality of the bot. Its main purpose will be to manage polling, authentication, and small games."
        },
        {
            "title": "College Club Watch Party Web Application",
            "techStack": "Svelte, TailwindCSS, ConsumetAPI",
            "description": "Project currently on pause for the summer. The main purpose of this web application is to have an easily accessible tool for the club to search for shows and add them into a list to be randomized for weekly watch parties."
        }
    ],
    "MoreInfo": {
        "title": "Jake Shoffner",
        "subTitle": "My Skills",
        "myInfo": [
            "Knoxville, TN",
            "(865) 978-2087"
        ],
        "techSkills":
        {
            "frontend": ["React", "Svelte", "Ember", "TailwindCSS"],
            "languages": ["JavaScript", "C++, C, C#", "Python", "Java"],
            "toolsOthers": ["Git", "Linux CLI", "Postman", "Github"]
        },
        "overallSkills": ["Front-end", "Scrum & Agile", "Problem Solving", "OOP"]
    }
}